public class I_Escape {
  public static void main(String[] args) {
    /*
    * 탈출문
      - 탈출문은 프로그램의 실행순거를 지정된 곳으로 이동시키는 문장으로 반복문 또는 블록구조에서 빠져 나올 때 사용합니다.
      - 탈출문의 키워드는 break, continue, return문이 있습니다.
      - goto는 자바의 키둬으에는 포함되어 있으나 사용하지는 않습니다.

      1.break
        - break는 반복문 내의 어떤 곳이든 위치할 수 있으며, 처리 도중에 break를 만나면 반복문을 곧바로 빠져나옵니다.
        - 중첩 반복문의 경우에 내부 반복문에서 break가 사용되었을 경우 그 break문이 속한 내부 반복문만 빠져나오게 됩니다.
        - 중첩 반복문에서 바깥쪽 반복문까지 종료시키려면 바깥쪽 반복문에 이름(label)을 붙이고, 'break 이름;'을 사용하면 됩니다.
      
      2.continue
        - continue문은 반복문 내의 어떤 곳이든지 위치할 수 있습니다.
        - continue문을 만나면 반복문의 맨 처음으로 제어가 이동하여 다음 반복문을 위한 증/감식을 실행합니다. 
        - continue문을 만날 때마다 이후 실행문은 건너뛰어 실행되지 않습니다.
      
      3.return
        - return문은 매서드의 실행을 끝내고 결과 값을 호출된 부분에 반환하는 문장입니다.
        - return문만 단독으로 사용했을 떄는 호출된 곳으로 제어만 넘어가지만, return문은 뒤에 연산식과 함께 사용되면 식의 결과 값ㅇ과 제어가 함께 넘어갑니다.
     */
  }
}
